# Текст справки (выводимой по команде /help), за исключением описания конкретных команд

HELP_TEXT = ("Бот позволяет узнать цену спотовых активов на Binance и ее изменение в процентах "
             "за прошедшие 24 часа.\n\n"
             "Вы можете напрямую ввести тикер интересующей Вас торговой пары в строке ввода сообщения, "
             "например, BTCUSDT.\n\n"
             "Кроме того, для этого можно воспользоваться командой /price\n\n"
             "При вводе тикера торговой пары можно использовать символы подстановки * и ? "
             "(* означает любое количество любых символов, ? - ровно один любой символ), "
             "что позволит Вам узнать цены сразу группы сходных по тикеру пар (примеры таких запросов: BTC*, "
             "ETHUSD?, *DAI).\n\n"
             "Другая удобная возможность - организовать интересующие Вас торговые пары "
             "в один или несколько списков, а затем просматривать и при необходимости "
             "редактировать любой из них.\n\n"
             "Один из списков Вы можете выбрать как тот, который будет выводиться автоматически при запуске бота "
             "(выполнении команды /start), "
             "что позволит Вам узнать цену наиболее важных для Вас торговых пар, вводя минимум команд.\n\n"

             "Доступные команды:\n\n")

